#Python for Beginner 제4장 요약

1. 산술 연산자에는 +, -, *, /, //, %, **등이 있다

2. int()나 float()함수로 문자열을 정수나 실수로 변환할 수 있다.
   숫자를 문자열로 변환하려면 str()함수를 사용한다.

3. 대입 연산자는 =외에도 +=, -=, *=, /=, %=, //=, **=을 사용할 수 있다.

4. 관계 연산자에는 ==, !=, >, <, >=, <=등이 있으며, 결과가 참이나 거짓이 된다

5. 논리 연산자는 주로 여러 가지 조건을 복합해서 사용하는데 and, or, not 세가지가 있다.

6. 비트 연산자에는 &, |, ^, ~, <<, >> 등이 있으며, 정수나 글자 등을 2진수로 변환한 후 각 자리의 비트끼리 연산한다.

7. 10&7은 1010&0111이므로 결과는 0010(10진수 2)이다.

8. 10|7은 1010|0111이므로 결과는 1111(10진수 15)이다.

9. 10^7은 1010^0111이므로 결과는 1101(10진수 13)이다.

10. 정수값에 비트 부정을 수행한 후 1을 더하면 해당 값의 음수 값을 얻을 수 있다.

11. 왼쪽 시프트 연산자는 2의n승을 곱한 효과를 주고, 오른쪽 시프트 연산자는 2의n승을 나눈 효과를 준다.

12. 연산자 우선순위에서 괄호가 최우선되며, 곱셈과 나눗셈이 덧셈과 뺄셈보다 우선한다.
    그리고 대입 연산자는 이 중 가장 늦게 처리된다.